"""
阿偉徹夜難眠

描述
阿偉最近失眠，所以阿偉決定來算數學：
他決定把每個數字的位數平方一路相加代替數羊，如 37 可以拆解為3和7：
====
算式請至 judge 查看
====

但他發現某些數字會數一數，最後就變成1，如：
10→1^2+0^2=1→1^2=1會成為死胡同，阿偉數到斷了就會繼續失眠，請幫阿偉用程式找出會讓他繼續失眠的數吧。
本題不須處理輸入輸出，僅須完成函數。

輸入
函數有一參數，型態為int。

輸出
函數有一回傳值，型態為bool，若會使阿偉失眠請回傳True。

輸入範例 1
is_happy(37)

輸出範例 1
False

輸入範例 2
is_happy(397)

輸出範例 2
True

提示
十進位下能夠無限進行的循環只有一串(起始點未必為4)
...→4 → 16 → 37 → 58 → 89 → 145 → 42 → 20 → 4→ ...
"""

def is_happy(num):
    #do something
    return ans

#We will run the following scripts. 
'''
s = int(input())
print(is_happy(s))
'''
